---
title: LinkLoadContent
classe: Autodesk.Revit.DB.LinkLoadContent
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ExternalResourceLoadContent
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# LinkLoadContent

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ModelPath GetLinkDataPath()` | `linkLoadContent.GetLinkDataPath()` | ModelPath |
| `LinkLoadResult GetLinkLoadResult()` | `linkLoadContent.GetLinkLoadResult()` | LinkLoadResult |
| `Void SetLinkDataPath(ModelPath)` | `linkLoadContent.SetLinkDataPath(linkPath)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```